# 2) შექმენით 10 list'ი, ყველას ჰქონდეს იმდენი ელემენტი რომელი ლისტიცაა ( განსხვავებული ელემენტები ყველგან ), მაგალითად:
# list1-ში იქნება 1 ელემენტი
# list2-ში იქნება 2 ელემენტი
# list3-ში იქნება 3 ელემენტი და ა.შ
# შემდეგ კი ყველას დაუწერეთ კომენტარებად დადებითი და უარყოფითი ინდექსები, როგორც კლასში გავაკეთეთ
list1 = [1]
list2 = [2,3]
list3 = [4,5,6]
list4 = [7,8,9,10]
list5 = [11,12,13,14,15]
list6 = ["a","b","c","f","l","p"]
list7 = [True,90,94,73,63,36,83]
list8 = [False,52,59,42,652,3,42,42]
list9 = [46,38,40,38,59,3,43,62,72]
list10 = [532,643,583,54,693,69,5583,693,649,649]
# 3) უკვე შექმნილი ლისტებიდან გამოიტანეთ ყველა ელემენტი ცალ-ცალკე indexing'ის მეშვეობით
print(list2[0],list2[1])
# 4) list'ებში ყველა ელემენტს შეუცვალეთ მნიშვნელობები, გამოიტანეთ საწყისი და საბოლოო list'ების ვარიანტები
list3[0]="aqlemi"
list3[1]="lomi"
list3[2]="zebra"
print(list3[0],list3[-1])

# 5) მოიძიეთ ინფორმაცია slicing'ის შესახებ, ეცადეთ ისწავლოთ და გატესტოთ. ( აუცილებელია, თუმცა გაკვეთილზეც ავხსნით თავიდან )
# გუგლში დასერჩეთ: slicing in python.

